Repository: Kostenkov-2021/AI-content-describer
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: There appears to be an older version of this add-on installed that is incompatable with future versions because the name has changed. It will be removed the next time NVDA is restarted.
ru: Похоже, что установлена старая версия дополнения, которая несовместима со следующими версиями, поскольку название было изменено. Она будет удалена при следующем перезапуске NVDA.

source: AI Content Describer
ru: AI Content Describer (Описатель контента с помощью ИИ)

source: Manage &models
ru: Управление &моделями

source: Model (configure more in the manage models dialog, defaults to last used):
ru: Модель (дополнительные настройки в диалоге "Управление моделями", по умолчанию используется последняя используемая модель):

source: Open each result in a browsable dialog; Markdown will be rendered if possible
ru: Открывать каждый результат в виртуальном просмотрщике; Markdown будет показан, если это возможно

source: Remember/cache descriptions of each item to save API quota
ru: Запоминать описания каждого элемента, чтобы сэкономить квоту API

source: Optimize images for size, may speed up detection in some situations (experimental)
ru: Оптимизировать изображения по размеру, может ускорить обнаружение в некоторых ситуациях (экспериментально)

source: Current focus
ru: Текущий фокус

source: Navigator object
ru: Объект Навигатора

source: Entire screen
ru: Весь экран

source: Take a picture
ru: Сделать снимок

source: Detect face position
ru: Определить положение лица

source: Select camera
ru: Выберите камеру

source: Release the camera to make it usable by other applications
ru: Отключите камеру, чтобы её можно было использовать в других приложениях

source: Face Detection (no API required)
ru: Распознавание лиц (API не требуется)

source: Model
ru: Модель

source: Follow-up on previous description
ru: Продолжение предыдущего описания

source: Please disable windows screen curtain before using AI content describer.
ru: Пожалуйста, отключите затемнение экрана Windows перед использованием AI content describer.

source: Content is not visible
ru: Содержимое не видно

source: Could not snap an image of the requested object
ru: Не удалось сделать изображение нужного объекта

source: Error initializing the face detection interface. Please consult the NVDA log for more information.
ru: Ошибка инициализации интерфейса обнаружения лиц. Пожалуйста, обратитесь к журналу NVDA для получения дополнительной информации.

source: Face detection interface is loading. Please try this command again after a couple seconds.
ru: Загружается интерфейс обнаружения лица. Пожалуйста, повторите эту команду через несколько секунд.

source: Could not get window content
ru: Не удалось получить содержимое окна

source: The picture could not be taken. Please ensure that your camera is not in use by another application and try again.
ru: Не удалось сделать снимок. Пожалуйста, убедитесь, что ваша камера не используется другим приложением и повторите попытку.

source: The picture could not be saved.
ru: Не удалось сохранить изображение.

source: The item on the clipboard is not an image.
ru: Элемент в буфере обмена не является изображением.

source: Unsupported image format. Please copy another file to the clipboard that is {formats}
ru: Неподдерживаемый формат изображения. Скопируйте в буфер обмена другой файл в формате {formats}

source: To describe content, you must provide an API key or base URL in the AI image describer category of the NVDA settings dialog. Please consult add-on help for more information
ru: Для описания содержимого вам необходимо указать ключ API или базовый URL-адрес в категории "описатель контента с помощью ИИ" в диалоге настроек NVDA. Пожалуйста, обратитесь к справке дополнения для получения подробной информации

source: To describe content, you must define a prompt by navigating to the AI image describer category of the NVDA settings dialog. Please consult add-on help for more information
ru: Для описания содержимого вы должны определить подсказку, перейдя в категорию "описатель контента с помощью ИИ" в диалоге настроек NVDA. Пожалуйста, обратитесь к справке дополнения для получения подробной информации

source: Retrieving description using {name}...
ru: Получение описания с помощью {name}...

source: Image description
ru: Описание изображения

source: Success
ru: Успешно

source: No AI service or conversation available.
ru: Нет доступных сервисов искусственного интеллекта или бесед.

source: Open the AI conversation dialog for follow-up questions and multimodal chat.
ru: Открыввает диалог Беседа с искусственным интеллектом для последующих вопросов и мультимодального чата.

source: Describe the image (or file path to an image) on the clipboard using AI.
ru: Описывает изображение (или изображение по пути к файлу) в буфере обмена с помощью ИИ.

source: Describe the contents of the current navigator object using AI.
ru: Описывает содержимое текущего объекта навигатора с помощью ИИ.

source: Describe the contents of the currently focused item using AI.
ru: Описывает содержимое элемента в фокусе с помощью ИИ.

source: Take a screenshot, then describe it using AI.
ru: Делает снимок экрана, а затем описывает его с помощью ИИ.

source: Pop up a menu asking whether to describe the current focus, navigator object, or entire screen with AI.
ru: Открывает всплывающее меню с вопросом, Хотите ли вы описать текущий фокус, объект навигатора или весь экран с помощью ИИ.

source: Snap a picture using the selected camera, then describe it using AI.
ru: Делает снимок экрана, а затем описывает его с помощью ИИ.

source: Describe the position of the face in the frame using the selected camera, if applicable.
ru: Описывает положение лица в кадре с помощью выбранной камеры, если это возможно.

source: Some of the dependencies required for this NVDA add-on to run are not available on your computer. Would you like to download them now? NVDA will need to be restarted when this process completes.
ru: Некоторые зависимости, необходимые для запуска этого дополнения NVDA, отсутствуют на вашем компьютере. Хотите установить их сейчас? По завершении этого процесса вам нужно будет перезапустить NVDA.

source: Some of the dependencies required for this NVDA add-on to run are outdated. Would you like to try to install them now? NVDA will need to be restarted when complete.
ru: Некоторые зависимости, необходимые для запуска этого дополнения, устарели. Хотите попробовать обновить их сейчас? По завершении установки необходимо будет перезапустить NVDA.

source: Would you like to delete the old dependencies from the configuration? This question will be asked once. If you are running multiple versions of NVDA interchangeably, select no.
ru: Вы хотите удалить устаревшие зависимости из конфигурации? Этот вопрос будет задан один раз. Если вы используете несколько версий NVDA одновременно, выберите "нет".

source: The dependencies have been downloaded successfully. NVDA will now restart for the changes to take affect
ru: Зависимости успешно загружены. NVDA будет перезагружена, чтобы изменения вступили в силу

source: Unfortunately, there doesn't yet seem to be dependencies available for the running version of NVDA. Please submit an issue in our bug tracker or contact the developers. In the meantime, you may wish to disable the add-on to surpress this message on startup.
ru: К сожалению, для текущей версии NVDA пока нет доступных зависимостей. Пожалуйста, сообщите о проблеме в нашем баг-трекере или свяжитесь с разработчиком. Между тем, вы можете отключить дополнение, чтобы убрать это сообщение при запуске NVDA.

source: Unfortunately, there was a problem downloading the dependencies required to run this add-on. Please consult the NVDA log for more details.
ru: К сожалению, возникла проблема с загрузкой зависимостей, необходимых для запуска этого дополнения. Чтобы узнать больше, обратитесь к журналу NVDA.

source: error
ru: ошибка

source: error making connection
ru: ошибка соединения

source: error, connection refused by target
ru: ошибка, конечный адресат отклонил соединение

source: The GPT4 model from OpenAI, previewed with vision capabilities. As of April 2024, this model has been superseded by GPT4 turbo which has consistently achieved better metrics in tasks involving visual understanding.
ru: Модель GPT4 от OpenAI, представленная с возможностями восприятия образов. По состоянию на апрель 2024 года эта модель была заменена моделью GPT4 Turbo, которая показала лучшие результаты в задачах, требующих понимания визуальной информации.

source: The next generation of the original GPT4 vision preview, with enhanced quality and understanding. This model will soon be deprecated so we recommend switching to GPT-4o.
ru: Следующее поколение оригинального GPT4 Vision с возможностями восприятия, с улучшенным качеством и пониманием. Эта модель скоро выйдет из употребления, поэтому мы рекомендуем перейти на GPT-4o.

source: OpenAI's first fully multimodal model, released in May 2024. This model has the same high intelligence as GPT4 and GPT4 turbo, but is much more efficient, able to generate text at twice the speed and at half the cost.
ru: Первая полностью мультимодальная модель OpenAI, выпущенная в мае 2024 года. Эта модель обладает таким же высоким интеллектом, как GPT4 и GPT4 turbo, но гораздо более эффективна, способна генерировать текст вдвое быстрее и вдвое дешевле.

source: Released in April 2025, o3 is a well-rounded and powerful model across domains. It sets a new standard for math, science, coding, and visual reasoning tasks. It also excels at technical writing and instruction-following. Use it to think through multi-step problems that involve analysis across text, code, and images.
ru: Выпущенная в апреле 2025 года, o3 представляет собой универсальную и мощную модель для различных областей знаний. Она устанавливает новый стандарт для задач по математике, естественным наукам, программированию и визуальному мышлению. Эта модель также превосходна в написании технических текстов и выполнении инструкций. Используйте её для решения многоэтапных задач, связанных с анализом текста, кода и изображений.

source: Released in June 2025, O3 pro is an upgraded version of O3. It is designed to think longer and provide the most reliable responses. Because o3-pro has access to tools, responses typically take longer than o1-pro to complete. We recommend using it for challenging questions where reliability matters more than speed, and waiting a few minutes is worth the tradeoff. Do not forget to tweak the timeout setting.
ru: O3 pro, выпущенная в июне 2025 года, является обновленной версией O3. Она разработана таким образом, чтобы дольше думать и предоставлять наиболее надёжные ответы. Поскольку o3-pro имеет доступ к инструментам, для получения ответов обычно требуется больше времени, чем o1-pro. Мы рекомендуем использовать её в сложных случаях, когда надёжность важнее скорости, а ожидание в течение нескольких минут стоит того, чтобы пойти на компромисс. Не забудьте настроить время ожидания.

source: Released in January 2025, this powerful and fast model advances the boundaries of what small models can achieve, delivering exceptional STEM capabilities with particular strength in science, math, and coding all while maintaining the low cost and reduced latency of OpenAI o1-mini.
ru: Выпущенная в январе 2025 года, эта мощная и быстрая модель расширяет возможности компактных моделей, обеспечивая исключительные возможности STEM, особенно в области науки, математики и программирования, при сохранении низкой стоимости и низкой задержки OpenAI o1-mini.

source: Released in April 2025, o4-mini is a smaller model optimized for fast, cost-efficient reasoning. It achieves remarkable performance for its size and cost, particularly in math, coding, and visual tasks. It has been shown to outperform O3 mini and supports significantly higher usage limits than o3, making it a strong high-volume, high-throughput option for questions that benefit from reasoning. Do not forget to tweak the timeout setting.
ru: O4-mini, выпущенная в апреле 2025 года, представляет собой уменьшенную модель, оптимизированную для быстрого и экономичного мышления. Для своих размеров и стоимости она обеспечивает замечательную производительность, особенно в математических задачах, программировании и визуализации. Было доказано, что она превосходит O3 mini по производительности и поддерживает значительно более высокие ограничения по использованию, чем o3, что делает её эффективным средством для решения вопросов с большим объёмом информации и высокой пропускной способностью. Не забудьте настроить время ожидания.

source: Gemini encountered an error: {code}, {msg}
ru: В Gemini произошла ошибка: {code}, {msg}

source: Google's Gemini 1.5 flash model with vision capabilities.
ru: Модель Gemini 1.5 flash от Google с возможностями восприятия образов.

source: Gemini 1.5 Flash-8B is a small model designed for high volume and lower intelligence tasks.
ru: Gemini 1.5 Flash-8B - это компактная модель, предназначенная для решения задач с большим объёмом данных и низким уровнем интеллекта.

source: Gemini 1.5 Pro is a mid-size multimodal model that is optimized for a wide-range of complex reasoning tasks requiring more intelligence. 1.5 Pro can process large amounts of data at once.
ru: Gemini 1.5 Pro - это мультимодальная модель среднего размера, оптимизированная для решения широкого спектра сложных логических задач, требующих повышенного интеллекта. 1.5 Pro может обрабатывать большие объёмы данных одновременно.

source: Gemini 2.5 Flash delivers fast performance for complex tasks. Ideal for tasks like summarization, chat applications, data extraction, and captioning.
ru: Gemini 2.5 Flash обеспечивает высокую производительность при выполнении сложных задач. Идеально подходит для таких задач, как подведение итогов, приложения для чата, извлечение данных и создание субтитров.

source: Gemini 2.5 Pro models are capable of reasoning through their thoughts before responding, resulting in enhanced performance and improved accuracy. Best for coding and complex tasks.
ru: Модели Gemini 2.5 Pro способны обдумывать свои действия, прежде чем реагировать, что повышает производительность и точность. Лучше всего подходит для программирования и решения сложных задач.

source: Gemini 2.0 Flash delivers next-gen features and improved capabilities, including superior speed, native tool use, multimodal generation, and a 1M token context window.
ru: Gemini 2.0 Flash предоставляет функции нового поколения и улучшенные возможности, включая превосходную скорость, использование встроенных инструментов, мультимодальную генерацию и контекстное окно с токенами размером 1 м.

source: Gemini 2.0 Flash lite preview is a Gemini 2.0 Flash model optimized for cost efficiency and low latency. Outperforms 1.5 Flash on the majority of benchmarks, at the same speed and cost.
ru: Gemini 2.0 Flash lite preview - это модель Gemini 2.0 Flash , оптимизированная для обеспечения экономичности и низкой задержки. Превосходит 1.5 Flash по большинству показателей при той же скорости и стоимости.

source: Claude encountered an error. {err}
ru: В Claude произошла ошибка. {err}

source: Anthropic's most powerful model for highly complex tasks.
ru: Самая мощная модель Anthropic для решения очень сложных задач.

source: Anthropic's model with Ideal balance of intelligence and speed, excels for enterprise workloads.
ru: Модель Anthropic с идеальным балансом интеллекта и скорости отлично подходит для корпоративных рабочих нагрузок.

source: Anthropic's fastest and most compact model for near-instant responsiveness
ru: Самая быстрая и компактная модель Anthropic, обеспечивающая практически мгновенное реагирование

source: Anthropic's improvement over Claude 3 sonnet, this model features enhanced reasoning capabilities relative to its predecessor.
ru: Усовершенствованная Anthropic по сравнению с Claude 3 sonnet, эта модель обладает расширенными возможностями мышления по сравнению со своей предшественницей.

source: Anthropic's next generation fastest model with improved reasoning across every skill set. Surpasses Claude 3 Opus on many benchmarks while maintaining speed and cost-effectiveness.
ru: Самая быстрая модель следующего поколения от Anthropic с улучшенной логикой для каждого набора навыков. Превосходит Claude 3 Opus по многим показателям, сохраняя при этом скорость и экономическую эффективность.

source: Anthropic's upgraded Claude 3.5 Sonnet with significant improvements in coding and computer use capabilities. Features enhanced reasoning and the ability to interact with computer interfaces.
ru: Компания Anthropic обновила Claude 3.5 Sonnet, значительно улучшив возможности программирования и использования компьютера. В ней расширены возможности мышления и взаимодействия с компьютерными интерфейсами.

source: Anthropic's most intelligent model to date and the first hybrid reasoning model. Features extended thinking capabilities for complex problem-solving with step-by-step reasoning.
ru: Самая интеллектуальная модель Anthropic на сегодняшний день и первая гибридная модель мышления. Расширяет возможности мышления для решения сложных задач с помощью пошаговых рассуждений.

source: Anthropic's high-performance model with exceptional reasoning and efficiency. Significant upgrade to Claude Sonnet 3.7 with superior coding and enhanced instruction following.
ru: Высокопроизводительная модель Anthropic с исключительной логикой и эффективностью. Значительное обновление до версии Claude Sonnet 3.7 с улучшенным пониманием задач по программированию и следованием инструкциям.

source: Anthropic's most capable and intelligent model yet. Sets new standards in complex reasoning and advanced coding with sustained performance on long-running tasks requiring focused effort.
ru: Самая эффективная и интеллектуальная модель Anthropic на сегодняшний день. Устанавливает новые стандарты в области сложных рассуждений и продвинутого программирования, обеспечивая стабильную производительность при выполнении длительных задач, требующих целенаправленных усилий.

source: MistralAI's multimodal image LLM, achieving state-of-the-art results on MathVista, DocVQA, VQAv2 and other benchmarks.
ru: MistralAI's multimodal image LLM, достигает самых современных результатов в MathVista, DocVQA, VQAv2 и других тестах.

source: xAI's flagship multimodal model with advanced reasoning capabilities. Excels at enterprise tasks like data extraction, programming, and text summarization with superior domain knowledge in finance, healthcare, law, and science.
ru: флагманская мультимодальная модель xAI с расширенными возможностями логического анализа. Отлично справляется с корпоративными задачами, такими как извлечение данных, программирование и составление текстовых отчетов, благодаря превосходному знанию предметной области в области финансов, здравоохранения, права и науки.

source: The quickest way to get up and running with large language models.
ru: Это самый быстрый способ начать работу с большими языковыми моделями.

source: Could not contact the provided base URL.
ru: Не удалось связаться с указанным базовым URL-адресом.

source: The response appears to be malformed.
ru: Ответ, по-видимому, был неправильно сформирован.

source: llama.cpp is a state-of-the-art, open-source solution for running large language models locally and in the cloud. This add-on integration assumes that you have obtained llama.cpp from Github and an image capable model from Huggingface or another repository, and that a server is currently running to handle requests. Though the process for getting this working is largely a task for the user that knows what they are doing, you can find basic steps in the add-on documentation.
ru: llama.cpp - это современное решение с открытым исходным кодом для запуска больших языковых моделей локально и в облаке. Эта интеграция предполагает, что вы получили llama.cpp с Github и модель с поддержкой изображений из Huggingface или другого репозитория, а также что в данный момент запущен сервер для обработки запросов. Несмотря на то, что процесс обеспечения работоспособности в значительной степени является задачей для пользователя, который знает, что делает, вы можете найти основные шаги в документации по дополнению.

source: Image recognition response appears to be malformed. {response}
ru: Реакция на распознавание изображений, по-видимому, искажена. {response}

source: Choose a camera
ru: Выберите камеру

source: &Available cameras
ru: &Доступные камеры

source: Camera selected. You may now trigger the command again.
ru: Камера выбрана. Теперь вы можете снова запустить команду.

source: far to the left of
ru: гораздо левее от

source: to the left of
ru: слева от

source: slightly to the left of
ru: чуть слева от

source: slightly to the right of
ru: чуть справа от

source: to the right of
ru: справа от

source: far to the right of
ru: гораздо правее от

source: far below
ru: слишком низко

source: below
ru: ниже

source: slightly below
ru: чуть ниже

source: slightly above
ru: чуть выше

source: above
ru: выше

source: far above
ru: слишком высоко

source: Face clearly in view
ru: Лицо чётко видно

source: and
ru: и

source: the center
ru: в центре

source: Failed to interface with the camera. Please ensure it is not in use by another application, then try again.
ru: Не удалось подключиться к камере. Пожалуйста, убедитесь, что она не используется другим приложением, а затем повторите попытку.

source: The footage from the camera is too blurry. Try switching your focus away from the desktop, then try this command again.
ru: Полученное с камеры изображение слишком размыто. Попробуйте переключить фокус с рабочего стола и повторите выполнение этой команды.

source: The footage from the camera is too blurry. Please ensure that it is not covered up and that your surroundings have proper lighting. {}
ru: Полученное с камеры изображение слишком размыто. Пожалуйста, убедитесь, что оно не закрыто и что в вашем окружении надлежащее освещение. {}

source: No face detected. Please ensure your face is in the frame and that your camera is not covered up.
ru: В фокусе камеры ни одного лица не обнаружено. Пожалуйста, убедитесь, что ваше лицо находится в кадре и что ваша камера не закрыта.

source: {} faces detected near the frame. Please try for another angle with fewer background objects.
ru: В кадре обнаружено {} лиц. Пожалуйста, попробуйте выбрать другой ракурс с меньшим количеством объектов на заднем плане.

source: No camera found on your system. Please connect one and try again.
ru: Ни одной камеры в вашей системе не обнаружено. Пожалуйста, подключите камеру и повторите попытку.

source: is no longer available. Switching to the other on the system.
ru: больше не доступна. Переключаюсь на другую камеру в системе.

source: Camera unavailable. Please try selecting another
ru: Выбранная камера недоступна. Пожалуйста, попробуйте выбрать другую

source: Starting the face detection interface. This may take a few seconds. Please wait.
ru: Запуск интерфейса распознавания лиц. Это может занять несколько секунд. Пожалуйста, подождите.

source: Failed to interface with the chosen camera
ru: Не удалось подключиться к выбранной камере

source: Model configuration
ru: Параметры модели

source: About this model
ru: Информация о модели

source: API key
ru: Ключ API

source: Base URL
ru: Базовый URL-адрес

source: Model name
ru: Название модели

source: List models
ru: Список моделей

source: Prompt
ru: Подсказка

source: Reset prompt to default
ru: Восстановить подсказку по умолчанию

source: Maximum tokens
ru: Максимальное количество токенов

source: Seconds to wait for a response before timing out
ru: Время ожидания ответа в секундах

source: About model
ru: О модели
