Repository: Kostenkov-2021/AI-content-describer
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: No models were found. Please install one, then try again.
ru: Не найдено ни одной модели. Пожалуйста, установите модель и повторите попытку.

source: Select a model
ru: Выберите модель

source: Model:
ru: Модель:

source: (requires installation)
ru: (требуется установка)

source: AI Conversation - {model}
ru: Беседа с искусственным интеллектом - {model}

source: Image:
ru: Изображение:

source: &Browse
ru: &Обзор

source: &Delete
ru: &Удалить

source: Include original image in context
ru: Включать исходное изображение в контекст

source: &History:
ru: &История:

source: Enter Your Message:
ru: Введите Своё сообщение:

source: &Options
ru: &Параметры

source: &Send
ru: &Отправить

source: Close
ru: Закрыть

source: You:
ru: Вы:

source: Original image (from initial description)
ru: Исходное изображение (из первоначального описания)

source: Image attached
ru: Изображение прикреплено

source: AI:
ru: Искусственный интеллект:

source: Choose an image
ru: Выберите изображение

source: Image files (*.jpg;*.jpeg;*.png;*.gif;*.webp)|*.jpg;*.jpeg;*.png;*.gif;*.webp
ru: Файлы изображений (*.jpg;*.jpeg;*.png;*.gif;*.webp)|*.jpg;*.jpeg;*.png;*.gif;*.webp

source: AI: (thinking...)
ru: Искусственный интеллект: (размышляет...)

source: No active conversation. Please restart the dialog.
ru: Активного диалога нет. Пожалуйста, перезапустите диалог.

source: Error:
ru: Ошибка:

source: &Clear Conversation
ru: &Очистить беседу

source: &Save Output to File
ru: &Сохранить вывод в файл

source: Conversation cleared
ru: Беседа очищена

source: Save conversation
ru: Сохранить беседу

source: Text files (*.txt)|*.txt
ru: Текстовые файлы (*.txt)|*.txt

source: Conversation saved
ru: Беседа сохранена

source: Error saving file
ru: Ошибка при сохранении файла

source: Would you like to attach this image to the current conversation?
ru: Хотели бы вы прикрепить это изображение к текущей беседе?

source: Attach Image
ru: Прикрепить изображение

source: This add-on makes it possible to describe the focus object, navigator object, or screen using popular vision capable AI language models, like Claude, Gemini, or GPT4. It also lets one understand where their face is positioned in the frame of a connected camera. Though content descriptions are quite detailed, they may not always be completely accurate or reflect real world information. Press NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer, or NVDA+alt+i to ask additional questions about a description. Other keystrokes are customizable from the input gestures dialog. By default, usage of GPT4 is free, thanks to the generocity of the team at PollinationsAI. If you would like to use other models from OpenAI, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API. Then, choose the "AI content describer" category from NVDA's settings dialog -> manage models and enter your API key. The process is similar for other model providers, see add-on documentation for more information on this.
ru: Это дополнение позволяет описывать объект в фокусе, объект навигатора или экран с помощью популярных языковых моделей ИИ с поддержкой зрения, таких как Claude, Gemini или GPT4. Оно также позволяет понять, где находится лицо в кадре с помощью подключённой камеры. Хотя описания контента довольно подробны, они не всегда могут быть полностью точными или отражать информацию из реального мира. Нажмите NVDA+shift+i, чтобы вызвать меню с вопросом о том, как вы хотите описать, основываясь на текущей позиции, или NVDA+shift+u, чтобы описать объект навигатора, или NVDA+shift+y для изображения, которое было скопировано в буфер обмена, например в проводнике Windows, или NVDA+alt+c, чтобы задать дополнительные вопросы об описании. Другие сочетания клавиш настраиваются в диалоге жесты ввода. По умолчанию GPT4 используется бесплатно, благодаря щедрости команды PollinationsAI. Если вы хотите использовать другие модели от OpenAI, зайдите на сайт https://platform.openai.com/account/api-keys и создайте учётную запись, затем создайте ключ для взаимодействия с API. Затем в диалоге настроек NVDA -> Управление моделями выберите категорию «Описатель содержимого AI» и введите свой ключ API. Для других поставщиков моделей процесс аналогичен, подробнее об этом читайте в документации к дополнению.
